InformationRegisters/кб99_Запросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кб99_Запросы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ApplicationID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗапросаПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_СтатусЗапроса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/кб_НезавершенныеПроизводственныеТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кб_НезавершенныеПроизводственныеТранзакции</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранзакцияОткрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродукцияЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОперацииНезавершенногоПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/кб99_РезервПартийВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>кб99_РезервПартийВСД</Name>
			<Comment>Резервирование партий ВСД при подборе в ВСД2_транзакцию. Снимается при получении ответа Ветис.</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/кб99_СтатусЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кб99_СтатусЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>COMPLETED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IN_PROCESS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ACCEPTED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ВетИС_РегламентныеЗаданияСервер/Ext/Module.bsl
// @grace-module: ВетИС_РегламентныеЗаданияСервер
// @grace-purpose: Регламентные задания ВСД: очистка запросов, гашение, отправка, управление заданиями платформы
// @grace-depends: ВетИС_ЯдроСервер, ВетИС_ПараметрыСервер, ВетИС_APIСервер, ВетИС_ГашениеСервер, ВетИС_ПроизводствоСервер, ВетИС_API_ТранзакцииСервер, ДлительныеОперации
// @grace-version: 2.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_РегламентныеЗаданияСервер"

// GRACE:MODULE_START name="ВетИС_РегламентныеЗаданияСервер"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_ПараметрыСервер"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_ГашениеСервер"
// GRACE:DEPENDENCY target="ВетИС_ПроизводствоСервер"
// GRACE:DEPENDENCY target="ДлительныеОперации"

#Область ПроцедурыРегламентныхЗаданий

// GRACE:CONTRACT function="кб99_ВСД_УдалитьСтарыеЗапросы"
// LLM_NOTE: Регламентное задание очистки регистра сведений кб99_Запросы. Удаляет старые записи по сроку хранения.
//   Для связанных объектов — только очищает тело запроса/ответа (не удаляет), для сиротских записей — удаляет полностью.
Процедура кб99_ВСД_УдалитьСтарыеЗапросы() Экспорт
	
	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );	
	КоличествоДней = ПараметрыОрганизации["КоличествоДнейХраненияЗапросов"];
	КоличествоДней = ?(КоличествоДней = 0, 30, КоличествоДней);
	
	//Очистка запросов по справочнику кб99_ВСД 
	Запрос1 = Новый Запрос("
		|ВЫБРАТЬ
		|	кб99_Запросы.*
		|ИЗ
		|	РегистрСведений.кб99_Запросы КАК кб99_Запросы
		|ГДЕ
		|	//НЕ кб99_Запросы.СтатусЗапроса = ""НЕТ""
		|	ТИПЗНАЧЕНИЯ(Объект) = ТИП(Справочник.кб99_ВСД2)
		|	И кб99_Запросы.Период < &ПериодОчистки");

	Запрос1.УстановитьПараметр("ПериодОчистки", ТекущаяДата() - КоличествоДней*86400);

	РезультатЗапроса = Запрос1.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.кб99_Запросы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Удалить();
	КонецЦикла;
	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	кб99_Запросы.*
	|ИЗ
	|	РегистрСведений.кб99_Запросы КАК кб99_Запросы
	|ГДЕ
	|	кб99_Запросы.Период < &ПериодОчистки";
	Запрос.УстановитьПараметр("ПериодОчистки", ТекущаяДата() - КоличествоДней*86400);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено( Выборка.Объект ) Тогда 
		
			Запись = РегистрыСведений.кб99_Запросы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Прочитать();
			Запись.Запрос = "";
			Запись.Ответ  = "";
			Запись.Ошибки = "";
			Запись.Записать();
			
		Иначе
			
			Запись = РегистрыСведений.кб99_Запросы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Удалить();
			
		КонецЕсли;
	КонецЦикла;	
	
	//Очистка запросов СтатусЗапроса = "НЕТ"
	Запрос1 = Новый Запрос("
		|ВЫБРАТЬ
		|	кб99_Запросы.СтатусЗапроса КАК СтатусЗапроса,
		|	кб99_Запросы.Пользователь КАК Пользователь,
		|	кб99_Запросы.ApplicationID КАК ApplicationID,
		|	кб99_Запросы.Период КАК Период,
		|	кб99_Запросы.Объект КАК Объект,
		|	кб99_Запросы.СтатусЗапросаПеречисление КАК СтатусЗапросаПеречисление
		|ИЗ
		|	РегистрСведений.кб99_Запросы КАК кб99_Запросы
		|ГДЕ
		|	НЕ кб99_Запросы.СтатусЗапроса = ""НЕТ""");

	НаборЗаписей = РегистрыСведений.кб99_Запросы.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос1.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
	
		
КонецПроцедуры

// GRACE:CONTRACT function="кб99_ВСД_УдалитьЗапросы_XML"
// LLM_NOTE: Удаляет XML-файлы логов старше порога хранения из каталога на диске. Работает с файловой системой сервера.
Процедура кб99_ВСД_УдалитьЗапросы_XML() Экспорт
	
	Попытка
		Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();	
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );	
		КаталогЛогов = ПараметрыОрганизации["КаталогЛогов"];
		КоличествоДней = ПараметрыОрганизации["КоличествоДнейХраненияЗапросов"];
		КоличествоДней = ?(КоличествоДней = 0, 30, КоличествоДней);
		ДатаГраницы = ТекущаяДата() - КоличествоДней*86400;
		Файлы = НайтиФайлы(КаталогЛогов, "*.xml");
		Для Каждого Файл Из Файлы Цикл
			Если Файл.ПолучитьВремяИзменения() < ДатаГраницы Тогда
				УдалитьФайлы(Файл.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;	
	Исключение
		ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"ВСД Ошибка при очистке файлов логов");
	КонецПопытки;
	
КонецПроцедуры

// GRACE:CONTRACT function="кб99_ПолучитьАктуальныеПартии"
// LLM_NOTE: Запускает фоновые задания загрузки партий Меркурий для каждой площадки через ДлительныеОперации.
//   После запуска обновляет ДатаАктуальностиПартий площадки — это важно для контроля окна запроса.
Процедура кб99_ПолучитьАктуальныеПартии(МассивПараметров) Экспорт
	
	Попытка
		Если ТипЗнч(МассивПараметров) <> Тип("Структура") Тогда
			ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Получить актуальные партии.");
			Возврат;
		КонецЕсли;
		
		СписокПлощадок = МассивПараметров.Площадки;
		Если СписокПлощадок.Количество() = 0 Тогда
			Возврат;	
		КонецЕсли;
		
		Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();	
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );
		
		ПараметрыОрганизации.Вставить("ПартииСмещение", 0);
		ПараметрыОрганизации.Вставить("УдалятьПартии", Ложь);
		ПараметрыОрганизации.Вставить("ТолькоАктуальныеПартии", Ложь);
		ПараметрыОрганизации.Вставить("ПартияКонПериода", ТекущаяДата());
		
		Для Каждого Площадка Из СписокПлощадок Цикл
			ПараметрыОрганизации.Вставить("ВыбПлощадка", Площадка.Значение);
			ПараметрыОрганизации.Вставить("ПартияНачПериода", Площадка.Значение.ДатаАктуальностиПартий);
			
			ИдентификаторЗадания = Неопределено;	
			
			НаименованиеЗадания = НСтр("ru = 'Регламентное задание - Ветис загрузка партий по площадке: '" + Площадка.Значение.Наименование);
			// LLM_NOTE: Фоновое задание запускается через ДлительныеОперации БСП — НЕ через ФоновыеЗадания напрямую.
		//   Это обеспечивает интеграцию с механизмом отмены и мониторинга заданий платформы.
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне( ,
											"ВетИС_APIСервер.Партии2_Запрос_Отправить_ВФоне",
											ПараметрыОрганизации,
											НаименованиеЗадания);
			
			ВСД_Площадка = Площадка.Значение.ПолучитьОбъект();
			ВСД_Площадка.ДатаАктуальностиПартий = ТекущаяДата();
			ВСД_Площадка.Записать();
		КонецЦикла;
	Исключение
		ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Получить актуальные партии.");
	КонецПопытки;

КонецПроцедуры

// GRACE:CONTRACT function="кб99_ОбновитьСтатусыВСД"
// LLM_NOTE: Запрашивает список транспортных ВСД из Меркурий за период для обновления статусов. HTTP-вызов внутри ПолучитьСписокВСД.
Процедура кб99_ОбновитьСтатусыВСД(МассивПараметров) Экспорт
	
	Попытка
		Если ТипЗнч(МассивПараметров) <> Тип("Структура") Тогда
			ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Обновить статусы ВСД");
			Возврат;
		КонецЕсли;
		
		Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();	
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);	

		КоличествоДней = МассивПараметров.КоличествоДней;
		НачалоПериода = ТекущаяДата() - КоличествоДней*86400;
		
		#Область ЗагрузкаСпискаТранспортныхВСДСФильтромПоДатеОформления
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("ПолучательПлощадка", 	ПараметрыОрганизации.Отправитель_Площадка);	
			ПараметрыЗапроса.Вставить("vetDocumentType", 		"TRANSPORT");	
			ПараметрыЗапроса.Вставить("vetDocumentStatus", 		"");	
			ПараметрыЗапроса.Вставить("Смещение", 				0);	
			ПараметрыЗапроса.Вставить("ПоступилиС",  			НачалоПериода);	
			ПараметрыЗапроса.Вставить("ПоступилиПо",			КонецДня(ТекущаяДата()));	
			ПараметрыЗапроса.Вставить("ОтправительХозСубъект", 	ПараметрыОрганизации.Отправитель_ХозСубъект);
			ПараметрыЗапроса.Вставить("ОтправительПлощадка", 	ПараметрыОрганизации.Отправитель_Площадка);	
			ПараметрыЗапроса.Вставить("Параметры", ПараметрыОрганизации);	
			ПараметрыЗапроса.Вставить("ДокОснование", Неопределено);	
				
			ВетИС_APIСервер.ПолучитьСписокВСД( ПараметрыЗапроса );
		#КонецОбласти
		
	Исключение
		ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Обновить статусы ВСД");
	КонецПопытки;
	
КонецПроцедуры

// GRACE:CONTRACT function="кб99_ГашениеВСД"
// LLM_NOTE: Автоматическое гашение входящих подтверждённых ВСД. Фильтрует: срок годности, совпадение количества, номер авто.
//   Гашение выполняется параллельно через ВСД2_Входящий_ОтправитьГашение_Параллельно — HTTP-вызовы в Меркурий.
Процедура кб99_ГашениеВСД(МассивПараметров) Экспорт
	
	Попытка
		Если ТипЗнч(МассивПараметров) <> Тип("Структура") Тогда
			ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке("Ошибка при передаче параметров. Ожидалось: Структура, получили: "+ТипЗнч(МассивПараметров)+" ",,"Ошибка при выполнение регламентного задания: Гашение входящих ВСД");
			Возврат;
		КонецЕсли;
		ПереопределяемыеПоляЗапроса = ВетИС_ДокументооборотСервер.ПолучитьПредставлениеПолейДокументаВЗапрос();
		
		Организация = МассивПараметров.Организация;
		СписокПлощадок = МассивПараметров.Площадки.ВыгрузитьЗначения();
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);	
		ИскатьДокументПрихода = ПараметрыОрганизации["ПарамВсдВходящиеИскатьДокументПрихода"];
		
		МассивВходящихВСД = Новый Массив;
		Для Каждого ВСД_Площадка Из СписокПлощадок Цикл
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("vetDocumentType", "INCOMING");	
			ПараметрыЗапроса.Вставить("vetDocumentStatus", "CONFIRMED");	
			ПараметрыЗапроса.Вставить("Смещение", 0);	
			ПараметрыЗапроса.Вставить("ОтправительХозСубъект", Справочники.ВСД_ХозСубъект.ПустаяСсылка());	
			ПараметрыЗапроса.Вставить("ОтправительПлощадка", Справочники.ВСД_Площадка.ПустаяСсылка());	
			ПараметрыЗапроса.Вставить("ПолучательПлощадка", ВСД_Площадка);	
			
			ПараметрыЗапроса.Вставить("Параметры", ПараметрыОрганизации);	
			ПараметрыЗапроса.Вставить("ДокОснование", Неопределено);	
			ПараметрыЗапроса.Вставить("ВсдРезультатМассив", МассивВходящихВСД);	
			
			Результат = ВетИС_APIСервер.ПолучитьСписокВСД( ПараметрыЗапроса );
			
		КонецЦикла;
						
		СписокВСДкГашению = Новый Массив;
		Для Каждого строкаВыборка Из МассивВходящихВСД Цикл
			
			Отказ = Ложь;	
			
			Номенклатура = ВетИС_ЯдроСервер.ПолучитьНоменклатуруПоПродукцияЭлемент( строкаВыборка.Продукция_Элемент, Истина );
			
			Если ИскатьДокументПрихода Тогда
				
				ДокументПрихода = ВетИС_ГашениеСервер.Гашение_НайтиДокументПоступлениеТоваров( строкаВыборка.ДокВСД.ТтнДата, 
					строкаВыборка.ДокВСД.ТтнНомер, строкаВыборка.Отправитель_Хозсубъект.ИНН );
				
				Если ЗначениеЗаполнено(ДокументПрихода) И ЗначениеЗаполнено(Номенклатура) Тогда 
					тзТовары = строкаВыборка.ДокументПрихода[ПереопределяемыеПоляЗапроса.НаименованиеТабличнойЧастиТовары].Выгрузить();
					
					ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
					Строки =  тзТовары.НайтиСтроки(ПараметрыОтбора);
					Если Строки.Количество()>0 Тогда
						КоличествоПринято = 0;	
						Для Каждого Стр Из Строки Цикл
							Попытка Коэфф = Стр.Коэффициент; Исключение Коэфф = 1 КонецПопытки;
							КоличествоПринято = КоличествоПринято + (Стр.Количество * Коэфф);	
						КонецЦикла;	
						
						Если строкаВыборка.Количество <> КоличествоПринято Тогда
							// Не совпадает количество
							Отказ = Истина;	
						КонецЕсли;
					Иначе
						// Не найдена продукция
						Отказ = Истина;
					КонецЕсли;
				Иначе
					// Не найден документ прихода или поступил товар без соответствия
					Отказ = Истина;	
				КонецЕсли;
				
			КонецЕсли;
			
			ДатаСрокГодности1= ВетИС_APIСервер.СтрокаВДатаВремя( строкаВыборка.ДатаСрокГодности1 );
		    Если ДатаСрокГодности1 < ТекущаяДата() Тогда
				// Просроченная партия
				Отказ = Истина;		
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено( СтрокаВыборка.номеравто ) Тогда
				// Не указан номер автомобиля
				Отказ = Истина;	
			КонецЕсли;
			
			Если Не Отказ Тогда
				СписокВСДкГашению.Добавить(СтрокаВыборка.ДокВСД);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СписокВСДкГашению.Количество() > 0 Тогда
			ПараметрыОрганизации.Вставить("СписокДокументов", СписокВСДкГашению);
			ПараметрыОрганизации.Вставить("флАктНесоответствия", Ложь);
			ПараметрыОрганизации.Вставить("тПричинаАкта", "");
			ПараметрыОрганизации.Вставить("тОписаниеНесоответствия", "");
			// LLM_NOTE: Параллельная отправка гашений — пакетный HTTP-запрос в Меркурий. Неопределено как второй параметр означает отсутствие формы UI.
		ВетИС_APIСервер.ВСД2_Входящий_ОтправитьГашение_Параллельно( ПараметрыОрганизации, Неопределено );
		КонецЕсли;
	Исключение
		ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Гашение входящих ВСД");
	КонецПопытки;
	
КонецПроцедуры

// GRACE:CONTRACT function="кб99_ОтложеннаяОтправкаВСД2Транзакции"
// LLM_NOTE: Отправляет ВСД2_транзакции по расписанию: сначала ПолучитьУсловияПеревозки, затем ОтправитьВСДвГИС.
//   Два прохода по выборке намеренны: первый заполняет условия, второй отправляет — НЕ оптимизировать в один цикл.
Процедура кб99_ОтложеннаяОтправкаВСД2Транзакции(МассивПараметров) Экспорт
	
	Попытка
		Если ТипЗнч(МассивПараметров) <> Тип("Структура") Тогда
			ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке("Ошибка при передаче параметров. Ожидалось: Структура, получили: "+ТипЗнч(МассивПараметров)+" ",,"Ошибка при выполнение регламентного задания: Отложенная отправка ВСД2 Транзакции");
			Возврат;
		КонецЕсли;
		
		Организация = МассивПараметров.Организация;
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВСД2_транзакция.Ссылка КАК ДокВСД
		|ИЗ
		|	Документ.ВСД2_транзакция КАК ВСД2_транзакция
		|ГДЕ
		|	НЕ ВСД2_транзакция.ПометкаУдаления
		|	И ВСД2_транзакция.ОтправкаПоРасписанию
		|	И ВСД2_транзакция.ДатаОтправки < &Дата
		|	И ВСД2_транзакция.СтатусВСД = ЗНАЧЕНИЕ(Перечисление.кб99_СтатусВСД.ПустаяСсылка)
		|	И ВСД2_транзакция.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВСД2_транзакция.ДатаОтправки";
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВетИС_ЯдроСервер.ПолучитьУсловияПеревозки(Выборка.ДокВСД);
			//ВетИС_ЯдроСервер.ОтправитьВСДвГИС(Выборка.ДокВСД);		
		КонецЦикла;
		
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			//ВетИС_ЯдроСервер.ПолучитьУсловияПеревозки(Выборка.ДокВСД);
			ВетИС_ЯдроСервер.ОтправитьВСДвГИС(Выборка.ДокВСД);		
		КонецЦикла;
	Исключение
		ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Отложенная отправка ВСД2 Транзакции");
	КонецПопытки;
	
КонецПроцедуры
 
// GRACE:CONTRACT function="кб99_ОбработатьДокументыПроизводство"
// LLM_NOTE: Пакетный запрос из 3 частей: отправка производства по расписанию, незавершённые транзакции, завершение по расписанию.
//   Индексы результатов [0] и [2] фиксированы структурой пакетного запроса — НЕ менять порядок подзапросов.
Процедура кб99_ОбработатьДокументыПроизводство(МассивПараметров) Экспорт
	
	Попытка
		Если ТипЗнч(МассивПараметров) <> Тип("Структура") Тогда
			ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке("Ошибка при передаче параметров. Ожидалось: Структура, получили: "+ТипЗнч(МассивПараметров)+" ",,"Ошибка при выполнение регламентного задания: Обработка документов ВСД2 производство");
			Возврат;
		КонецЕсли;
		
		Организация = МассивПараметров.Организация;
		ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
		
		Запрос = Новый Запрос;
        Запрос.Текст =
		"ВЫБРАТЬ
		|	ВСД2_Производство.Ссылка КАК ВСДДок,
		|	ВЫБОР
		|		КОГДА НЕ кб99_ЗапросыСрезПоследних.СтатусЗапроса ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отправить
		|ИЗ
		|	Документ.ВСД2_Производство КАК ВСД2_Производство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.кб99_Запросы.СрезПоследних(&Дата, ) КАК кб99_ЗапросыСрезПоследних
		|		ПО ВСД2_Производство.Ссылка = кб99_ЗапросыСрезПоследних.Объект
		|ГДЕ
		|	НЕ ВСД2_Производство.ПометкаУдаления
		|	И ВСД2_Производство.ОтправкаПоРасписанию
		|	И ВСД2_Производство.ДатаОтправки < &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВСД2_Производство.ДатаОтправки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	кб_НезавершенныеПроизводственныеТранзакцииСрезПоследних.НомерОперацииНезавершенногоПроизводства КАК НомерОперацииНезавершенногоПроизводства,
		|	кб_НезавершенныеПроизводственныеТранзакцииСрезПоследних.Площадка КАК Площадка,
		|	МИНИМУМ(кб_НезавершенныеПроизводственныеТранзакцииСрезПоследних.ТранзакцияОткрыта) КАК ТранзакцияОткрыта
		|ПОМЕСТИТЬ втПоследниеСтатусыТранзакций
		|ИЗ
		|	РегистрСведений.кб_НезавершенныеПроизводственныеТранзакции.СрезПоследних КАК кб_НезавершенныеПроизводственныеТранзакцииСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	кб_НезавершенныеПроизводственныеТранзакцииСрезПоследних.НомерОперацииНезавершенногоПроизводства,
		|	кб_НезавершенныеПроизводственныеТранзакцииСрезПоследних.Площадка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерОперацииНезавершенногоПроизводства,
		|	Площадка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВСД2_Производство.Ссылка КАК ВСДДок,
		|	ВСД2_Производство.ДатаЗавершения КАК ДатаЗавершения,
		|	втПоследниеСтатусыТранзакций.НомерОперацииНезавершенногоПроизводства КАК НомерОперацииНезавершенногоПроизводства,
		|	втПоследниеСтатусыТранзакций.ТранзакцияОткрыта КАК ТранзакцияОткрыта,
		|	втПоследниеСтатусыТранзакций.Площадка КАК Площадка
		|ИЗ
		|	втПоследниеСтатусыТранзакций КАК втПоследниеСтатусыТранзакций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВСД2_Производство КАК ВСД2_Производство
		|		ПО (втПоследниеСтатусыТранзакций.НомерОперацииНезавершенногоПроизводства = ВСД2_Производство.operationId
		|				И втПоследниеСтатусыТранзакций.Площадка = ВСД2_Производство.Производитель_Площадка
		|				И ВСД2_Производство.ЗавершениеПоРасписанию
		|				И ВСД2_Производство.ДатаЗавершения < &Дата)
		|ГДЕ
		|	втПоследниеСтатусыТранзакций.ТранзакцияОткрыта";
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", Организация);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатЗапроса[0].Пустой() Тогда
			ДокументыКОтправке = РезультатЗапроса[0].Выбрать();
			Пока ДокументыКОтправке.Следующий() Цикл
				Если ДокументыКОтправке.Отправить Тогда
					ВетИС_ЯдроСервер.ОтправитьВСДвГИС(ДокументыКОтправке.ВСДДок);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не РезультатЗапроса[2].Пустой() Тогда
			ДокументыКЗавершению = РезультатЗапроса[2].Выбрать();
			Пока ДокументыКЗавершению.Следующий() Цикл
				
				ПараметрыОрганизации.Вставить( "ЗавершитьПроизводство", Истина );
		
				СписокПродукции = Новый Массив;
				тзПродукция = ДокументыКЗавершению.ВСДДок.Продукция.Выгрузить();
				тзПродукция.Свернуть("Продукция_Элемент, ДатаИзготовления1");
				Для Каждого Стр Из тзПродукция Цикл
					СтруктураСтроки = Новый Структура("ПродукцияЭлемент, ДатаПроизводства", Стр.Продукция_Элемент, Стр.ДатаИзготовления1);
				    СписокПродукции.Добавить(СтруктураСтроки);
				КонецЦикла;
				
				ПараметрыЗаполнения = Новый Структура;
				ПараметрыЗаполнения.Вставить("ПараметрыОрганизации", ПараметрыОрганизации);
				ПараметрыЗаполнения.Вставить("Площадка", ДокументыКЗавершению.Площадка);
				ПараметрыЗаполнения.Вставить("НомерОперации", ДокументыКЗавершению.НомерОперацииНезавершенногоПроизводства);
				ПараметрыЗаполнения.Вставить("СписокПродукции", СписокПродукции);
				
				ДокументЗавершенияПроизводства = ВетИС_ПроизводствоСервер.ОформитьДокументЗавершенияПроизводства(ПараметрыЗаполнения);
				ВетИС_APIСервер.ЗавершитьПроизводство( ПараметрыОрганизации, ДокументЗавершенияПроизводства );

			КонецЦикла;
		КонецЕсли;
	
	Исключение
		ВетИС_ЯдроСервер.кб99_СообщитьОбОшибке(ОписаниеОшибки(),,"Ошибка при выполнение регламентного задания: Обработка документов ВСД2 производство");
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПоРаботеСРегламентнымиЗаданиями

// GRACE:CONTRACT function="ДобавитьРегламентноеЗадание"
// Добавляет новое регламентное задание (без учета очереди заданий модели сервиса).
// 
// Параметры: 
//  Параметры - Структура - параметры добавляемого задания, возможные свойства:
//   * Использование - Булево - Истина, если регламентное задание должно выполняться автоматически согласно расписанию. 
//   * Метаданные    - ОбъектМетаданныхРегламентноеЗадание - обязательно для указания. Объект метаданных, на основе 
//                              которого будет создано регламентное задание.
//   * Параметры     - Массив - параметры регламентного задания. Количество и состав параметров должны соответствовать 
//                              параметрам метода регламентного задания.
//   * Ключ          - Строка - прикладной идентификатор регламентного задания.
//   * ИнтервалПовтораПриАварийномЗавершении - Число - интервал в секундах, через который нужно перезапускать задание 
//                              в случае его аварийного завершения.
//   * Расписание    - РасписаниеРегламентногоЗадания - расписание задания.
//   * КоличествоПовторовПриАварийномЗавершении - Число - количество повторов при аварийном завершении задания.
//
// Возвращаемое значение:
//  РегламентноеЗадание
//
Функция ДобавитьРегламентноеЗадание(Параметры) Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	МетаданныеЗадания = Параметры.Метаданные;
	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);
	
	Если Параметры.Свойство("Наименование") Тогда
		Задание.Наименование = Параметры.Наименование;
	Иначе
		Задание.Наименование = МетаданныеЗадания.Наименование;
	КонецЕсли;
	
	Если Параметры.Свойство("Использование") Тогда
		Задание.Использование = Параметры.Использование;
	Иначе
		Задание.Использование = МетаданныеЗадания.Использование;
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") Тогда
		Задание.Ключ = Параметры.Ключ;
	Иначе
		Задание.Ключ = МетаданныеЗадания.Ключ;
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяПользователя") Тогда
		Задание.ИмяПользователя = Параметры.ИмяПользователя;
	КонецЕсли;
	
	Если Параметры.Свойство("ИнтервалПовтораПриАварийномЗавершении") Тогда
		Задание.ИнтервалПовтораПриАварийномЗавершении = Параметры.ИнтервалПовтораПриАварийномЗавершении;
	Иначе
		Задание.ИнтервалПовтораПриАварийномЗавершении = МетаданныеЗадания.ИнтервалПовтораПриАварийномЗавершении;
	КонецЕсли;
	
	Если Параметры.Свойство("КоличествоПовторовПриАварийномЗавершении") Тогда
		Задание.КоличествоПовторовПриАварийномЗавершении = Параметры.КоличествоПовторовПриАварийномЗавершении;
	Иначе
		Задание.КоличествоПовторовПриАварийномЗавершении = МетаданныеЗадания.КоличествоПовторовПриАварийномЗавершении;
	КонецЕсли;
	
	Если Параметры.Свойство("Параметры") Тогда
		Задание.Параметры = Параметры.Параметры;
	КонецЕсли;
	
	Если Параметры.Свойство("Расписание") Тогда
		Задание.Расписание = Параметры.Расписание;
	КонецЕсли;
	
	Задание.Записать();
	
	Возврат Задание;
	
КонецФункции

// GRACE:CONTRACT function="ИзменитьРегламентноеЗадание"
// LLM_NOTE: Изменяет только те свойства задания, которые переданы в Параметры. Проверка ЕстьИзменения исключает лишние Записать().
// Изменяет регламентное задание (без учета очереди заданий модели сервиса).
//
// Параметры: 
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                                     непредопределенного регламентного задания.
//                - Строка - имя метаданных предопределенного регламентного задания
//                           или строка уникального идентификатора регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - РегламентноеЗадание - регламентное задание.
//
//  Параметры - Структура - параметры, которые следует установить заданию, возможные свойства:
//   * Использование - Булево - Истина, если регламентное задание должно выполняться автоматически согласно расписанию.
//   * Параметры     - Массив - параметры регламентного задания. Количество и состав параметров должны соответствовать
//                              параметрам метода регламентного задания.
//   * Ключ          - Строка - прикладной идентификатор регламентного задания.
//   * ИнтервалПовтораПриАварийномЗавершении - Число - интервал в секундах, через который нужно перезапускать задание
//                              в случае его аварийного завершения.
//   * Расписание    - РасписаниеРегламентногоЗадания - расписание задания.
//   * КоличествоПовторовПриАварийномЗавершении - Число - количество повторов при аварийном завершении задания.
//   
Процедура ИзменитьРегламентноеЗадание(Знач Идентификатор, Знач Параметры) Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	
	Идентификатор = УточненныйИдентификаторЗадания(Идентификатор);
	ИдентификаторЗадания = УникальныйИдентификаторЗадания(Идентификатор);
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КэшПрограммныхИнтерфейсов");
	//ЭлементБлокировки.УстановитьЗначение("Идентификатор", Строка(ИдентификаторЗадания));
	
	//НачатьТранзакцию();
	Попытка
		//Блокировка.Заблокировать();
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если Задание <> Неопределено Тогда
			ЕстьИзменения = Ложь;
			
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"Наименование", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"Использование", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"Ключ", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"ИмяПользователя", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"ИнтервалПовтораПриАварийномЗавершении", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"КоличествоПовторовПриАварийномЗавершении", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"Параметры", Параметры, ЕстьИзменения);
			ОбновитьЗначениеСвойстваЗадания(Задание,
				"Расписание", Параметры, ЕстьИзменения);
			
			Если ЕстьИзменения Тогда
				Задание.Записать();
			КонецЕсли;
		КонецЕсли;
		//ЗафиксироватьТранзакцию();
	Исключение
		//ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// GRACE:CONTRACT function="УдалитьРегламентноеЗадание"
// LLM_NOTE: Предопределённые задания удалить невозможно — кидается исключение. Это защита от потери системных заданий.
// Удаляет регламентное задание (без учета очереди заданий модели сервиса).
//
// Параметры:
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                                     непредопределенного регламентного задания.
//                - Строка - имя метаданных предопределенного регламентного задания
//                           или строка уникального идентификатора регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - РегламентноеЗадание - регламентное задание, уникальный идентификатор которого используется 
//                  для определения удаляемого экземпляра регламентного задания.
//
Процедура УдалитьРегламентноеЗадание(Знач Идентификатор) Экспорт
	
	Идентификатор = УточненныйИдентификаторЗадания(Идентификатор);
	
	СписокЗаданий = Новый Массив; // Массив из РегламентноеЗадание.
	
	Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") И Идентификатор.Предопределенное Тогда
		ВызватьИсключение( НСтр("ru = 'Предопределенное регламентное задание удалить невозможно.'") );
	ИначеЕсли ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") И Не Идентификатор.Предопределенное Тогда
		СписокЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", Идентификатор));
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
		Если РегламентноеЗадание <> Неопределено Тогда
			СписокЗаданий.Добавить(РегламентноеЗадание);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого РегламентноеЗадание Из СписокЗаданий Цикл
		ИдентификаторЗадания = УникальныйИдентификаторЗадания(РегламентноеЗадание);
		
		//Блокировка = Новый БлокировкаДанных;
		//ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КэшПрограммныхИнтерфейсов");
		//ЭлементБлокировки.УстановитьЗначение("Идентификатор", Строка(ИдентификаторЗадания));
		//
		//НачатьТранзакцию();
		Попытка
			//Блокировка.Заблокировать();
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
			Если Задание <> Неопределено Тогда
				Задание.Удалить();
			КонецЕсли;
			//ЗафиксироватьТранзакцию();
		Исключение
			//ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция УточненныйИдентификаторЗадания(Знач Идентификатор)
	
	Если ТипЗнч(Идентификатор) = Тип("РегламентноеЗадание") Тогда
		Идентификатор = Идентификатор.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		ОбъектМетаданных = Метаданные.РегламентныеЗадания.Найти(Идентификатор);
		Если ОбъектМетаданных = Неопределено Тогда
			Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
		Иначе
			Идентификатор = ОбъектМетаданных;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

Функция УникальныйИдентификаторЗадания(Знач Идентификатор, ВРазделенномРежимеИдентификаторЗаданияОчереди = Ложь)
	
	Если ТипЗнч(Идентификатор) = Тип("УникальныйИдентификатор") Тогда
		Возврат Идентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("РегламентноеЗадание") Тогда
		Возврат Идентификатор.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Возврат Новый УникальныйИдентификатор(Идентификатор);
	КонецЕсли;
	
	Если ВРазделенномРежимеИдентификаторЗаданияОчереди
	   И ОбщегоНазначения.РазделениеВключено() Тогда
		
		Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") Тогда
			ПараметрыЗадания = Новый Структура("Метаданные", Идентификатор);
			СписокЗаданий = НайтиЗадания(ПараметрыЗадания);
			Если СписокЗаданий = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Для Каждого Задание Из СписокЗаданий Цикл
				Возврат Задание.Идентификатор.УникальныйИдентификатор();
			КонецЦикла;
		ИначеЕсли ТипЗнч(Идентификатор) = Тип("СтрокаТаблицыЗначений") Тогда
			Возврат Идентификатор.Идентификатор.УникальныйИдентификатор();
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Идентификатор)) Тогда
			Возврат Идентификатор.УникальныйИдентификатор();
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") И Идентификатор.Предопределенное Тогда
			Возврат РегламентныеЗадания.НайтиПредопределенное(Идентификатор).УникальныйИдентификатор;
		ИначеЕсли ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") И НЕ Идентификатор.Предопределенное Тогда
			СписокЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные", Идентификатор));
			Для каждого РегламентноеЗадание Из СписокЗаданий Цикл
				Возврат РегламентноеЗадание.УникальныйИдентификатор;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает РегламентноеЗадание из информационной базы.
//
// В модели сервиса работает с регламентными заданиями платформы, а не с заданиями очереди,
// одинаково как в разделенном, так и в неразделенном режимах.
//
// Параметры:
//  Идентификатор - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//                  предопределенного регламентного задания.
//                - УникальныйИдентификатор - идентификатор регламентного задания.
//                - Строка - строка уникального идентификатора регламентного задания.
//                - РегламентноеЗадание - регламентное задание из которого нужно получить
//                  уникальный идентификатор для получения свежей копии регламентного задания.
// 
// Возвращаемое значение:
//  РегламентноеЗадание - прочитано из базы данных.
//
Функция ПолучитьРегламентноеЗадание(Знач Идентификатор) Экспорт
	
	Если ТипЗнч(Идентификатор) = Тип("РегламентноеЗадание") Тогда
		Идентификатор = Идентификатор.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("Строка") Тогда
		Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
	КонецЕсли;
	
	Если ТипЗнч(Идентификатор) = Тип("ОбъектМетаданных") Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Идентификатор);
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если РегламентноеЗадание = Неопределено Тогда
		ВызватьИсключение( НСтр("ru = 'Регламентное задание не существует.
		                              |Возможно оно удалено другим пользователем.'") );
	КонецЕсли;
	
	Возврат РегламентноеЗадание;
	
КонецФункции

// GRACE:CONTRACT function="НайтиЗадания"
Функция НайтиЗадания(Отбор) Экспорт
	
	КопияОтбора = ОбщегоНазначения.СкопироватьРекурсивно(Отбор); // см. НайтиЗадания.Отбор
	СписокЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(КопияОтбора);
	
	Возврат СписокЗаданий;
			
КонецФункции

// GRACE:CONTRACT function="СообщенияИОписанияОшибокРегламентногоЗадания"
// LLM_NOTE: Использует УстановитьПривилегированныйРежим для чтения фоновых заданий — иначе нет доступа без прав администрирования.
// Возвращает многострочную Строку содержащую Сообщения и ОписаниеИнформацииОбОшибке,
// последнее фоновое задание найдено по идентификатору регламентного задания
// и сообщения/ошибки есть.
//
// Параметры:
//  Задание      - РегламентноеЗадание
//               - Строка - УникальныйИдентификатор
//                 РегламентногоЗадания строкой.
//
// Возвращаемое значение:
//  Строка
//
Функция СообщенияИОписанияОшибокРегламентногоЗадания(Знач Задание) Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);

	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(Задание) = Тип("РегламентноеЗадание"), Строка(Задание.УникальныйИдентификатор), Задание);
	СвойстваПоследнегоФоновогоЗадания = СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(ИдентификаторРегламентногоЗадания);
	Возврат ?(СвойстваПоследнегоФоновогоЗадания = Неопределено,
	          "",
	          СообщенияИОписанияОшибокФоновогоЗадания(СвойстваПоследнегоФоновогоЗадания.Идентификатор));
	
КонецФункции

// Возвращает свойства последнего фонового задания выполненного при выполнении регламентного задания, если оно есть.
// Процедура работает, как в файл-серверном, так и в клиент-серверном режимах.
//
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание
//                      - Строка - строка уникального идентификатора РегламентногоЗадания.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений:
//     * Идентификатор - Строка
//     * Наименование - Строка
//     * Ключ - Строка
//     * Конец - Дата
//     * ИдентификаторРегламентногоЗадания - Строка
//     * Состояние - СостояниеФоновогоЗадания
//     * ИмяМетода - Строка
//     * Расположение - Строка
//     * ОписаниеИнформацииОбОшибке - Строка
//     * ПопыткаЗапуска - Число
//     * СообщенияПользователю - Массив
//     * НомерСеанса - Число
//     * НачалоСеанса - Дата
//
Функция СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(РегламентноеЗадание)
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание"), Строка(РегламентноеЗадание.УникальныйИдентификатор), РегламентноеЗадание);
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторРегламентногоЗадания", ИдентификаторРегламентногоЗадания);
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = СвойстваФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	Возврат СвойстваФоновогоЗадания;
	
КонецФункции

// GRACE:CONTRACT function="СвойстваФоновыхЗаданий"
// LLM_NOTE: УстановитьПривилегированныйРежим обязателен — платформа требует прав для работы с ФоновыеЗадания.ПолучитьФоновыеЗадания.
// Возвращает таблицу свойств фоновых заданий.
//  Структуру таблицы смотри в функции ПустаяТаблицаСвойствФоновыхЗаданий().
// 
// Параметры:
//  Отбор        - Структура - допустимые поля:
//                 Идентификатор, Ключ, Состояние, Начало, Конец,
//                 Наименование, ИмяМетода, РегламентноеЗадание. 
//
// Возвращаемое значение:
//   см. НовыеСвойстваФоновыхЗаданий
//
Функция СвойстваФоновыхЗаданий(Отбор = Неопределено) Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Таблица = НовыеСвойстваФоновыхЗаданий();
	
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания") Тогда
		Отбор.Удалить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
		ПолучитьПоследнее = Истина;
	Иначе
		ПолучитьПоследнее = Ложь;
	КонецЕсли;
	
	РегламентноеЗадание = Неопределено;
	
	// Добавление истории фоновых заданий, полученных с сервера.
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ИдентификаторРегламентногоЗадания") Тогда
		Если Отбор.ИдентификаторРегламентногоЗадания <> "" Тогда
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
				Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			ТекущийОтбор = Новый Структура("Ключ", Отбор.ИдентификаторРегламентногоЗадания);
			ФоновыеЗаданияЗапущенныеВручную = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			Если РегламентноеЗадание <> Неопределено Тогда
				ПоследнееФоновоеЗадание = РегламентноеЗадание.ПоследнееЗадание;
			КонецЕсли;
			Если НЕ ПолучитьПоследнее ИЛИ ПоследнееФоновоеЗадание = Неопределено Тогда
				ТекущийОтбор = Новый Структура("РегламентноеЗадание", РегламентноеЗадание);
				АвтоматическиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			КонецЕсли;
			Если ПолучитьПоследнее Тогда
				Если ПоследнееФоновоеЗадание = Неопределено Тогда
					ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеВМассиве(АвтоматическиеФоновыеЗадания);
				КонецЕсли;
				
				ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеВМассиве(
					ФоновыеЗаданияЗапущенныеВручную, ПоследнееФоновоеЗадание);
				
				Если ПоследнееФоновоеЗадание <> Неопределено Тогда
					МассивФоновыхЗаданий = Новый Массив;
					МассивФоновыхЗаданий.Добавить(ПоследнееФоновоеЗадание);
					ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
				КонецЕсли;
				Возврат Таблица;
			КонецЕсли;
			ДобавитьСвойстваФоновыхЗаданий(ФоновыеЗаданияЗапущенныеВручную, Таблица);
			ДобавитьСвойстваФоновыхЗаданий(АвтоматическиеФоновыеЗадания, Таблица);
		Иначе
			МассивФоновыхЗаданий = Новый Массив;
			ВсеИдентификаторыРегламентныхЗаданий = Новый Соответствие;
			Для каждого ТекущееЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
				ВсеИдентификаторыРегламентныхЗаданий.Вставить(
					Строка(ТекущееЗадание.УникальныйИдентификатор), Истина);
			КонецЦикла;
			ВсеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания();
			Для каждого ТекущееЗадание Из ВсеФоновыеЗадания Цикл
				Если ТекущееЗадание.РегламентноеЗадание = Неопределено
				   И ВсеИдентификаторыРегламентныхЗаданий[ТекущееЗадание.Ключ] = Неопределено Тогда
				
					МассивФоновыхЗаданий.Добавить(ТекущееЗадание);
				КонецЕсли;
			КонецЦикла;
			ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Отбор) Тогда
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
		Иначе
			Если Отбор.Свойство("Идентификатор") Тогда
				Отбор.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор(Отбор.Идентификатор));
				Отбор.Удалить("Идентификатор");
			КонецЕсли;
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			Если Отбор.Свойство("УникальныйИдентификатор") Тогда
				Отбор.Вставить("Идентификатор", Строка(Отбор.УникальныйИдентификатор));
				Отбор.Удалить("УникальныйИдентификатор");
			КонецЕсли;
		КонецЕсли;
		ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ИдентификаторРегламентногоЗадания") Тогда
		РегламентныеЗаданияДляОбработки = Новый Массив;
		Если Отбор.ИдентификаторРегламентногоЗадания <> "" Тогда
			Если РегламентноеЗадание = Неопределено Тогда
				РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
					Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			КонецЕсли;
			Если РегламентноеЗадание <> Неопределено Тогда
				РегламентныеЗаданияДляОбработки.Добавить(РегламентноеЗадание);
			КонецЕсли;
		КонецЕсли;
	Иначе
		РегламентныеЗаданияДляОбработки = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	КонецЕсли;
	
	Таблица.Сортировать("Начало Убыв, Конец Убыв");
	
	// Отбор фоновых заданий.
	Если ЗначениеЗаполнено(Отбор) Тогда
		Начало    = Неопределено;
		Конец     = Неопределено;
		Состояние = Неопределено;
		Если Отбор.Свойство("Начало") Тогда
			Начало = ?(ЗначениеЗаполнено(Отбор.Начало), Отбор.Начало, Неопределено);
			Отбор.Удалить("Начало");
		КонецЕсли;
		Если Отбор.Свойство("Конец") Тогда
			Конец = ?(ЗначениеЗаполнено(Отбор.Конец), Отбор.Конец, Неопределено);
			Отбор.Удалить("Конец");
		КонецЕсли;
		Если Отбор.Свойство("Состояние") Тогда
			Если ТипЗнч(Отбор.Состояние) = Тип("Массив") Тогда
				Состояние = Отбор.Состояние;
				Отбор.Удалить("Состояние");
			КонецЕсли;
		КонецЕсли;
		
		Если Отбор.Количество() <> 0 Тогда
			Строки = Таблица.НайтиСтроки(Отбор);
		Иначе
			Строки = Таблица;
		КонецЕсли;
		// Выполнение дополнительного отбора по периоду и состоянию (если отбор определен).
		НомерЭлемента = Строки.Количество() - 1;
		Пока НомерЭлемента >= 0 Цикл
			Если Начало    <> Неопределено И Начало > Строки[НомерЭлемента].Начало
				Или Конец     <> Неопределено И Конец  < ?(ЗначениеЗаполнено(Строки[НомерЭлемента].Конец), Строки[НомерЭлемента].Конец, ТекущаяДатаСеанса())
				Или Состояние <> Неопределено И Состояние.Найти(Строки[НомерЭлемента].Состояние) = Неопределено Тогда
				Строки.Удалить(НомерЭлемента);
			КонецЕсли;
			НомерЭлемента = НомерЭлемента - 1;
		КонецЦикла;
		// Удаление лишних строк из таблицы.
		Если ТипЗнч(Строки) = Тип("Массив") Тогда
			НомерСтроки = Таблица.Количество() - 1;
			Пока НомерСтроки >= 0 Цикл
				Если Строки.Найти(Таблица[НомерСтроки]) = Неопределено Тогда
					Таблица.Удалить(Таблица[НомерСтроки]);
				КонецЕсли;
				НомерСтроки = НомерСтроки - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// GRACE:CONTRACT function="СообщенияИОписанияОшибокФоновогоЗадания"
// Возвращает многострочную Строку содержащую Сообщения и ОписаниеИнформацииОбОшибке,
// если фоновое задание найдено по идентификатору и сообщения/ошибки есть.
//
// Параметры:
//  Задание      - Строка - УникальныйИдентификатор ФоновогоЗадания строкой.
//
// Возвращаемое значение:
//  Строка
//
Функция СообщенияИОписанияОшибокФоновогоЗадания(Идентификатор, СвойстваФоновогоЗадания = Неопределено) Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Если СвойстваФоновогоЗадания = Неопределено Тогда
		СвойстваФоновогоЗадания = ПолучитьСвойстваФоновогоЗадания(Идентификатор);
	КонецЕсли;
	
	Строка = "";
	Если СвойстваФоновогоЗадания <> Неопределено Тогда
		Для каждого Сообщение Из СвойстваФоновогоЗадания.СообщенияПользователю Цикл
			Строка = Строка + ?(Строка = "",
			                    "",
			                    "
			                    |
			                    |") + Сообщение.Текст;
		КонецЦикла;
		Если ЗначениеЗаполнено(СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке) Тогда
			Строка = Строка + ?(Строка = "",
			                    СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке,
			                    "
			                    |
			                    |" + СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

// GRACE:CONTRACT function="ПолучитьСвойстваФоновогоЗадания"
// Возвращает свойства ФоновогоЗадания по строке уникального идентификатора.
//
// Параметры:
//  Идентификатор - Строка - уникального идентификатора ФоновогоЗадания.
//  ИменаСвойств  - Строка - если заполнено, возвращается структура с указанными свойствами.
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Структура - свойства ФоновогоЗадания.
//
Функция ПолучитьСвойстваФоновогоЗадания(Идентификатор, ИменаСвойств = "") Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Идентификатор", Идентификатор);
	ТаблицаСвойствФоновыхЗаданий = СвойстваФоновыхЗаданий(Отбор);
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(ИменаСвойств) Тогда
			Результат = Новый Структура(ИменаСвойств);
			ЗаполнитьЗначенияСвойств(Результат, ТаблицаСвойствФоновыхЗаданий[0]);
		Иначе
			Результат = ТаблицаСвойствФоновыхЗаданий[0];
		КонецЕсли;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает новую таблицу свойств фоновых заданий.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//     * Идентификатор - Строка
//     * Наименование - Строка
//     * Ключ - Строка
//     * Конец - Дата
//     * ИдентификаторРегламентногоЗадания - Строка
//     * Состояние - СостояниеФоновогоЗадания
//     * ИмяМетода - Строка
//     * Расположение - Строка
//     * ОписаниеИнформацииОбОшибке - Строка
//     * ПопыткаЗапуска - Число
//     * СообщенияПользователю - Массив
//     * НомерСеанса - Число
//     * НачалоСеанса - Дата
//
Функция НовыеСвойстваФоновыхЗаданий()
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Идентификатор",                     Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Наименование",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Ключ",                              Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Начало",                            Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("Конец",                             Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторРегламентногоЗадания", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Состояние",                         Новый ОписаниеТипов("СостояниеФоновогоЗадания"));
	НоваяТаблица.Колонки.Добавить("ИмяМетода",                         Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Расположение",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ОписаниеИнформацииОбОшибке",        Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ПопыткаЗапуска",                    Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("СообщенияПользователю",             Новый ОписаниеТипов("Массив"));
	НоваяТаблица.Колонки.Добавить("НомерСеанса",                       Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("НачалоСеанса",                      Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Индексы.Добавить("Идентификатор, Начало");
	
	Возврат НоваяТаблица;
	
КонецФункции

// Параметры:
//   МассивФоновыхЗаданий - Массив из ФоновоеЗадание
//   ПоследнееФоновоеЗадание - ФоновоеЗадание
//                           - Неопределено
// Возвращаемое значение:
//   ФоновоеЗадание, Неопределено
//
Функция ПоследнееФоновоеЗаданиеВМассиве(МассивФоновыхЗаданий, ПоследнееФоновоеЗадание = Неопределено)
	
	Для каждого ТекущееФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		Если ПоследнееФоновоеЗадание = Неопределено Тогда
			ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПоследнееФоновоеЗадание.Конец) Тогда
			Если НЕ ЗначениеЗаполнено(ТекущееФоновоеЗадание.Конец)
			 ИЛИ ПоследнееФоновоеЗадание.Конец < ТекущееФоновоеЗадание.Конец Тогда
				ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ТекущееФоновоеЗадание.Конец)
			   И ПоследнееФоновоеЗадание.Начало < ТекущееФоновоеЗадание.Начало Тогда
				ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоследнееФоновоеЗадание;
	
КонецФункции
  
Процедура ДобавитьСвойстваФоновыхЗаданий(Знач МассивФоновыхЗаданий, Знач ТаблицаСвойствФоновыхЗаданий)
	
	Индекс = МассивФоновыхЗаданий.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ФоновоеЗадание = МассивФоновыхЗаданий[Индекс]; // ФоновоеЗадание
		Строка = ТаблицаСвойствФоновыхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ФоновоеЗадание);
		Строка.Идентификатор = ФоновоеЗадание.УникальныйИдентификатор;
		РегламентноеЗадание = ФоновоеЗадание.РегламентноеЗадание;
		
		Если РегламентноеЗадание = Неопределено
		   И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ФоновоеЗадание.Ключ) Тогда
			
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ));
		КонецЕсли;
		Строка.ИдентификаторРегламентногоЗадания = ?(
			РегламентноеЗадание = Неопределено,
			"",
			РегламентноеЗадание.УникальныйИдентификатор);
		
		Строка.ОписаниеИнформацииОбОшибке = ?(
			ФоновоеЗадание.ИнформацияОбОшибке = Неопределено,
			"",
			ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке));
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

// GRACE:CONTRACT function="ПредставлениеРегламентногоЗадания"
// LLM_NOTE: УстановитьПривилегированныйРежим нужен для чтения метаданных задания без проверки прав пользователя.
// Возвращает представление регламентного задания,
// это по порядку исключения незаполненных реквизитов:
// Наименование, Метаданные.Синоним, Метаданные.Имя.
//
// Параметры:
//  Задание      - РегламентноеЗадание
//               - Строка - если строка, тогда УникальныйИдентификатор строкой.
//
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеРегламентногоЗадания(Знач Задание) Экспорт
	
	//ВызватьИсключениеЕслиНетПраваАдминистрирования();
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") Тогда
		РегламентноеЗадание = Задание;
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Задание));
	КонецЕсли;
	
	Если РегламентноеЗадание <> Неопределено Тогда
		Если РегламентноеЗадание.Предопределенное Тогда
			Представление = РегламентноеЗадание.Метаданные.Синоним;
		Иначе
			Представление = РегламентноеЗадание.Наименование;
			
			Если ПустаяСтрока(РегламентноеЗадание.Наименование) Тогда
				Представление = РегламентноеЗадание.Метаданные.Синоним;
			КонецЕсли;
		КонецЕсли;
		Если ПустаяСтрока(Представление) Тогда
			Представление = РегламентноеЗадание.Метаданные.Имя;
		КонецЕсли
	Иначе
		Представление = ТекстНеОпределено();
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// GRACE:CONTRACT function="ТекстНеОпределено"
// Возвращает текст "<не определено>".
Функция ТекстНеОпределено() Экспорт
	
	Возврат НСтр("ru = '<не определено>'");
	
КонецФункции

// Для процедуры ИзменитьЗадание.
Процедура ОбновитьЗначениеСвойстваЗадания(Задание, ИмяСвойства, ПараметрыЗадания, ЕстьИзменения)
	
	Если Не ПараметрыЗадания.Свойство(ИмяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	Если Задание[ИмяСвойства] = ПараметрыЗадания[ИмяСвойства]
	 Или ТипЗнч(Задание[ИмяСвойства]) = Тип("РасписаниеРегламентногоЗадания")
	   И ТипЗнч(ПараметрыЗадания[ИмяСвойства]) = Тип("РасписаниеРегламентногоЗадания")
	   И Строка(Задание[ИмяСвойства]) = Строка(ПараметрыЗадания[ИмяСвойства]) Тогда
		
		Возврат;
	КонецЕсли;
	
	Задание[ИмяСвойства] = ПараметрыЗадания[ИмяСвойства];
	ЕстьИзменения = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОчисткаРезервовПартий

// GRACE:CONTRACT function="кб99_ОчисткаЗависшихРезервов"
// @grace-contract: кб99_ОчисткаЗависшихРезервов
//   Вход: нет
//   Выход: нет
//   Инвариант: удаляет резервы по документам старше 24 часов без активных запросов (IN_PROCESS/ACCEPTED)
//   GRACE-лог: ЛогВход, ЛогУспех
// LLM_NOTE: Регламентное задание очистки зависших резервов партий ВСД.
//   Резерв считается зависшим, если документу-регистратору более 24 часов
//   и по нему нет активного запроса в кб99_Запросы (IN_PROCESS или ACCEPTED).
Процедура кб99_ОчисткаЗависшихРезервов() Экспорт

	Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);

	Если НЕ ПараметрыОрганизации["КонтролироватьРезервыПартий"] Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	кб99_РезервПартийВСД.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.кб99_РезервПартийВСД КАК кб99_РезервПартийВСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.кб99_Запросы КАК кб99_Запросы
	|		ПО кб99_РезервПартийВСД.Регистратор = кб99_Запросы.Объект
	|			И (кб99_Запросы.СтатусЗапросаПеречисление = &СтатусInProcess
	|				ИЛИ кб99_Запросы.СтатусЗапросаПеречисление = &СтатусAccepted)
	|ГДЕ
	|	кб99_РезервПартийВСД.Период < &ГраницаДавности
	|	И кб99_Запросы.Объект ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ГраницаДавности", ТекущаяДата() - 86400);
	Запрос.УстановитьПараметр("СтатусInProcess", Перечисления.кб99_СтатусЗапроса.IN_PROCESS);
	Запрос.УстановитьПараметр("СтатусAccepted", Перечисления.кб99_СтатусЗапроса.ACCEPTED);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВетИС_API_ТранзакцииСервер.ОчиститьРезервПартий(Выборка.Регистратор);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

// GRACE:MODULE_END name="ВетИС_РегламентныеЗаданияСервер"
